# RebarShapeSpiralBaseFinishingTurns Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RebarShapeSpiralBaseFinishingTurns Property
ParameterTypeId Class See Also
---
"Base Finishing Turns"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RebarShapeSpiralBaseFinishingTurns { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RebarShapeSpiralBaseFinishingTurns As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RebarShapeSpiralBaseFinishingTurns {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace